Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_UsingSwiftWithCocoaAndObjective-C/Swift_BCA-level2.tmx
Source language: en_us
Languages: ja

source: The arch(arm) platform condition does not return true for ARM 64 devices.
ja: arch(arm)プラットホーム条件は、ARM 64機器に対してtrueを返しません。

source: The name and friends properties are both declared with the @NSManaged attribute to indicate that Core Data provides their implementation and storage at runtime.
ja: nameとfriendsプロパティは、両方とも@NSManaged属性を使って宣言され、コアデータがそれらの実装とストレージを実行時に提供することを指し示します。

source: The prepare(withInvocationTarget:) method returns a proxy to the specified target.
ja: prepare(withInvocationTarget:)メソッドは、措定されたtargetに対する代理を返します。

source: The @available attribute uses the same syntax as the #available runtime check, with the platform version requirements provided as comma-delimited arguments.
ja: @available属性は、コンマ区切り引数として提供されるプラットホームバージョン要件を使う、#available実行時確認と同じ構文を使います。

source: The NSString class encodes a Unicode-compliant text string, represented as a sequence of UTF–16 code units.
ja: NSStringクラスは、一連のUTF–16コード単位として表される、あるユニコード遵守テキスト文字列を符号化します。

source: The as? operator returns an optional value that can be bound to a constant using an if-let statement.
ja: as?演算子は、if-let文を使って定数に束縛されることができるオプショナルの値を返します。

source: The is operator returns true if the instance is of that subclass type, and false if it is not.
ja: is演算子は、そのインスタンスがそのサブクラス型であるならばtrueを、それがそうでないならばfalse返します。

source: The CFArrayCreateMutable(_:_:_:) function takes a CFArrayCallBacks structure, which is initialized with function pointer callbacks:
ja: CFArrayCreateMutable(_:_:_:)関数は、ひとつのCFArrayCallBacks構造体を取ります、それは関数ポインタコールバックで初期化されます：

source: The arch(i386) platform condition returns true when code is compiled for the 32–bit iOS simulator.
ja: arch(i386)プラットホーム条件は、コードが32ビットiOSシミュレーターに対してコンパイルされるときtrueを返します。

source: The getVaList(_:) function takes an array of CVarArg values and returns a CVaListPointer value, whereas the withVaList(_:_:) provides this value within the body a closure parameter rather than returning it directly.
ja: getVaList(_:)関数は、CVarArg値からなるひとつの配列をとってCVaListPointer値を返します、一方でwithVaList(_:_:)は、この値を本文内部でクロージャパラメータに提供します、それを直接返すのではなく。

source: The myCount constant is inferred to be an optional Int, and is set to nil.
ja: myCount定数は、オプショナルのIntであると推論されて、nilに設定されます。

source: The #keyPath string expression accepts chained method or property references.
ja: #keyPath文字列式は、数珠つなぎにされたメソッドまたはプロパティ参照を受け入れます。

source: The AnyHashable type is implicitly converted from any Hashable type, and you can use the as? and as! operators to cast from AnyHashable to a more specific type.
ja: AnyHashable型は暗黙的に何らかのHashable型から変換されます、そしてあなたはas?およびas!演算子を使ってAnyHashableからより具体的な型へキャストできます。

source: The Core Foundation CFTypeRef type completely remaps to the AnyObject type.
ja: コアファウンデーションのCFTypeRef型は、AnyObject型に完全にリマップされます。

source: The Foundation framework provides a base layer of functionality for apps and frameworks, including data storage, text processing, dates and times, sorting and filtering, persistence, and networking.
ja: Foundationフレームワークは、ある基盤階層をアプリとフレームワークのための機能性に関して提供していて、データストレージ、テキスト処理、日付と時刻、ソートとフィルタ、永続、そしてネートワーク処理を含みます。

source: The Migration Process
ja: 移動プロセス

source: The Objective-C id type is imported by Swift as the Any type.
ja: Objective-C id型は、スウィフトによってAny型としてインポートされます。

source: The Objective-C functionality will be available in any Swift file within that target automatically, without any import statements.
ja: Objective-C機能性は、まったくインポート文なしで、自動的にそのターゲット内のどんなスウィフトファイルにおいても利用できます。

source: The Swift String type is composed of encoding-independent Unicode characters, and provides support for accessing those characters in various Unicode representations.
ja: スウィフトのString型は、符号化非依存のユニコード文字から構成されます、そしてそれらの文字に様々なユニコード表現においてアクセスするための支援を提供します。

source: The Swift Foundation overlay provides the following bridged value types for the following Objective-C reference types:
ja: スウィフト Foundationオーバーレイは、以下のブリッジ値型を以下のObjective-C参照型に対して提供します：

source: The Swift Foundation overlay renames classes and protocols, as well as related enumerations and constants.
ja: スウィフト Foundationオーバーレイは、クラスおよびプロトコルを改名します、それだけでなく関連した列挙と定数も。

source: The Swift compiler automatically imports Objective-C code as conventional Swift code.
ja: スウィフトコンパイラは、自動的にObjective-Cコードを普通の意味でのスウィフトコードとしてインポートします。

source: The Swift compiler does not include a preprocessor.
ja: スウィフトコンパイラは、プリプロセッサを含みません。

source: The Swift compiler ensures that your initializers do not leave any properties in your class uninitialized to increase the safety and predictability of your code.
ja: スウィフトコンパイラは、あなたのコードの安全性と予測可能性を高めるためにあなたのイニシャライザたちがアンイニシャライズされるあなたのクラスにおいて１つのプロパティもそのままにしておかないことを確実にします。

source: The Swift compiler includes attributes that enable Interface Builder features for your Swift classes.
ja: スウィフトコンパイラは、あなたのスウィフトクラスのためにインタフェースビルダー機能を可能にする属性を含みます。

source: The Swift files in your framework target will be visible in Objective-C .m files containing this import statement.
ja: あなたのフレームワークターゲットの中のスウィフトファイルは、このインポート文を含んでいるObjective-C .mファイルにおいて見えるようになります。

source: The Swift files in your target will be visible in Objective-C .m files containing this import statement.
ja: あなたのターゲットの中のスウィフトファイルは、このインポート文を含んでいるObjective-C .mファイルにおいて見えるようになります。

source: The address of that buffer is passed to the callee, and on return, the value in the buffer is loaded, retained, and reassigned into the operand.
ja: そのバッファのアドレスは呼び出される側に渡されます、そして戻る時に、バッファの値はロードされ、保持され、演算数に再割り当てされます。

source: The argument passed to the CF_SWIFT_NAME macro uses the same syntax as the #selector expression.
ja: CF_SWIFT_NAMEマクロに渡された引数は、#selector式と同じ構文を使います。

source: The base implementation of the isEqual: provided by the NSObject class is equivalent to an identity check by pointer equality.
ja: NSObjectクラスによって提供されるisEqual:の基本実装は、ポインタ同等性による同一性確認に等しいものです。

source: The code listing below illustrates the following process:
ja: 下記のコード出力は、次の過程を例示します：

source: The compiler automatically infers the name of the overridden Objective-C method that matches the Swift method name.
ja: コンパイラは、そのスウィフトメソッド名と適合するオーバーライドされたObjective-Cメソッドの名前を自動的に推論します。

source: The compiler removes Ref from the end of each type name because all Swift classes are reference types, therefore the suffix is redundant.
ja: コンパイラは各型名の終わりからRefを削除します、なぜなら全てのスウィフトクラスが参照型であり、したがってこの接尾辞は冗長です。

source: The contents of the Objective-C files in that framework will be available in any Swift file within that framework target automatically, without any import statements.
ja: そのフレームワークの中のObjective-Cファイルの中身は、まったくインポート文なしで、そのフレームワークターゲット内のあらゆるスウィフトファイルにおいて自動的に利用可能になります。

source: The corresponding reference types can be accessed with their original NS class name prefix.
ja: 対応する参照型は、それら本来のNSクラス名接頭辞でアクセスされることができます。

source: The default implementation of the == operator invokes the isEqual: method, and the default implementation of the === operator checks pointer equality.
ja: ==演算子の省略時の実装は、isEqual:メソッドを発動します、そして===演算子の省略時の実装はポインタの同等性を調べます。

source: The differences between Objective-C and Swift syntax are all the more apparent when instantiating objects.
ja: Objective-Cとスウィフト構文の間の違いは、オブジェクトをインスタンス化するとき全て明らかになります。

source: The example below shows a customized error type defined using the NS_ERROR_ENUM macro in Objective-C:
ja: 下の例は、Objective-CにおいてNS_ERROR_ENUMを使ってカスタマイズされたエラー型を示します：

source: The example below shows availability information used in a conditional statement in Swift:
ja: 下の例は、スウィフトでの条件文で使われる利用可能性情報を示します：

source: The example below shows availability information used on a declaration in Swift:
ja: 下の例は、スウィフトでのある宣言で使われる利用可能性情報を示します：

source: The first argument appears immediately inside the parentheses, without a name.
ja: 最初の引数は、名前なしで、丸括弧の直ぐ内側に現れます。

source: The first element in CommandLine.arguments is a path to the executable.
ja: CommandLine.argumentsの中の最初の項目は、常に実行ファイルへのパスです。

source: The first, equality (==), compares the contents of the objects.
ja: １つめ、同等性（==）は、オブジェクトの内容を比較します。

source: The following code shows how String? instances bridge to Objective-C depending on their value.
ja: 以下のコードは、どのようにString?インスタンスがObjective-Cへとそれの値に基づいてブリッジするかを示します。

source: The following mappings apply:
ja: 以下のマッピングを適用します：

source: The following tables use Type as a placeholder type name to indicate syntax for the mappings.
ja: 以下の表は、Typeをプレースホルダー型名として使ってマップのための構文を示します。

source: The general import model for working with both languages within the same target is depicted below and described in more detail in the following sections.
ja: 同じターゲット内で両方の言語を扱う一般的なインポートモデルは下で表され、更に詳細に以下の節において記述されます。

source: The import process is straightforward.
ja: インポートプロセスは単刀直入です。

source: The imported Swift structure contains a stored property for each C structure field and an initializer whose parameters correspond to the stored properties.
ja: インポートされたスウィフト構造体は、各C構造体フィールドに対してひとつの保存プロパティを、そしてそれのパラメータが保存プロパティと対応するひとつのイニシャライザを含みます。

source: The importing process determines how functions, classes, methods, and types declared in Objective-C code appear in Swift.
ja: このインポートブロセスは、Objective-Cコードにおいて宣言した関数、クラス、メソッド、そして型が、スウィフトの中にどのように現れるかを決定します。

source: The last argument is an asterisk (*), which is used to handle potential future platforms.
ja: 最後の引数は、ひとつのアスタリスクです（*）、それは潜在的な将来のプラットホームを取り扱うために使われます。

source: The macro behaves just like the NS_SWIFT_UNAVAILABLE macro except that it omits the customizable error message and it restricts compile-time access to the declaration in Objective-C code.
ja: このマクロはちょうどNS_SWIFT_UNAVAILABLEマクロのように振舞います、しかしそれがカスタマイズ可能なエラーメッセージを省略することと、それがコンパイル時アクセスをObjective-Cコードの中の宣言に制限することを除きます。

source: The methods that perform a selector synchronously, such as perform(_:), return an implicitly unwrapped optional unmanaged pointer to an AnyObject instance (Unmanaged<AnyObject>!), because the type and ownership of the value returned by performing the selector can’t be determined at compile time.
ja: セレクタを同期的に実行するメソッド、例えばperform(_:)は、AnyObjectインスタンス（Unmanaged<AnyObject>!）に対する暗黙的にアンラップされたオプショナルの非管理ボインタを返します、なぜならセレクタ実行によって返される値の型と所有権はコンパイル時に確定されることができないからです。

source: The model for importing Swift into Objective-C is similar to the one used for importing Objective-C into Swift.
ja: スウィフトをObjective-Cにインポートすることの原型は、Objective-Cをスウィフトにインポートするために使われるものに似ています。

source: The most effective approach for migrating code to Swift is on a per-file basis—that is, one class at a time.
ja: スウィフトへの移っているコードのために最も効果的なアプローチは、ファイル毎原則の上にあります ― すなわち、一度にひとつのクラス。

source: The name of the Xcode-generated header for Swift code, and the name of the Objective-C bridging header that Xcode creates for you, are generated from your product module name.
ja: スウィフトコードのためのXcode生成のヘッダの名前、そしてXcodeがあなたの代わりにつくるObjective-C橋渡しヘッダのの名前は、あなたの製品モジュール名から生成されます。

source: The name of this header is your product module name followed by adding "-Swift.h".
ja: このヘッダの名前は、あなたの製品モジュール名に続けて"-Swift.h"を加えたものです。

source: The path should be relative to your project, similar to the way your Info.plist path is specified in Build Settings.
ja: パスは、あなたのプロジェクトに相対的でなければなりません、あなたのInfo.plistパスが「Build Settings」において指定される方法に似ています。

source: The pointer passed to the function is guaranteed to be valid only for the duration of the function call.
ja: 関数に渡されるポインタは、その関数呼び出しの継続期間に対してのみ有効であることを保証されます。

source: The prefixes to C enumeration case names are removed when they are imported into Swift, whether they’re defined in system frameworks or in custom code.
ja: C列挙ケース節名への接頭辞は、それらがスウィフトにインポートされるとき削除されます、それらがシステムフレームワークでまたはあつらえのコードで定義されるかに関係なくです。

source: The process described in this section applies to non-framework targets.
ja: この節で記述されるプロセスは、非フレームワークターゲットにあてはまります。

source: The process for importing an external framework is the same whether the framework is written in a single language or contains files from both languages.
ja: 外部フレームワークをインポートするプロセスは、そのフレームワークが１つだけの言語で書かれるか、両方の言語からのファイルを含むかに関係なく、同じものです。

source: The process for working with mixed-language targets differs slightly depending on whether you’re writing an app or a framework.
ja: 混合言語のターゲットを扱う過程は、あなたがアプリを書いているかフレームワークを書いているかに従い、わずかに異なります。

source: The raw buffer pointer types, UnsafeRawBufferPointer and UnsafeMutableRawBufferPointer, let you view or mutate a contiguous block of memory as a collection of UInt8 values, where each value corresponds to a byte of memory.
ja: 生のバッファポインタ型、UnsafeRawBufferPointerおよびUnsafeMutableRawBufferPointerは、あなたにメモリの隣接ブロックをUInt8値のコレクションとして眺めさせたり変化させたりします、そこで各値はメモリのあるバイトに対応します。

source: The rest of the selector pieces correspond to argument names and appear inside the parentheses.
ja: 残りのセレクタ片は、引数名に相当して、括弧の内側に現れます。

source: The resulting CVaListPointer value is then passed to the va_list argument of the C variadic function.
ja: 結果のCVaListPointer値は、それからC可変長引数関数のva_list引数に渡されます。

source: The second, identity (===), determines whether or not the constants or variables refer to the same object instance.
ja: ２つめ、同一性（===）は、定数または変数が同じオブジェクトインスタンスに言及するかどうかを確認します。

source: The string will automatically be converted to UTF8 in a buffer, and a pointer to that buffer is passed to the function.
ja: その文字列は、あるバッファにおいて自動的にUTF8に変換されます、そしてそのバッファへのポインタが関数へ渡されます。

source: The syntax of a #keyPath string expression is similar to the syntax of a #selector expression, as described in Selectors.
ja: #keyPath文字列式の構文は、#selector式の構文に似ています、セレクタで記述されるように。

source: The target-action model is fundamentally similar in Swift and Objective-C.
ja: ターゲット-アクションの雛形は、スウィフトとObjective-Cで基本的に類似しています。

source: The type of the property must conform to the NSCopying protocol.
ja: プロパティの型は、NSCopyingプロトコルに準拠しなければなりません。

source: The typed buffer pointer types, UnsafeBufferPointer and UnsafeMutableBufferPointer, let you view or mutate a contiguous block of memory.
ja: 型付きバッファポインタ型、UnsafeBufferPointerおよびUnsafeMutableBufferPointerは、あなたにメモリの隣接ブロックを眺めさせたり変化させたりします。

source: The unified logging system provides an API for capturing messaging across all levels of the system, and is a replacement for the NSLog function in the Foundation framework.
ja: 統合ログシステムは、システムのすべての水準にまたがってメッセージを捕らえるためにAPIを提供します、そしてFoundationフレームワークにおけるNSLog関数に対する置き換えです。

source: The use of self in a CF_SWIFT_NAME argument is used for instance methods to refer to the method receiver.
ja: CF_SWIFT_NAME引数におけるselfの使用は、インスタンスメソッドに対して使われてメソッドのレシーバを参照します。

source: There are two distinct types of comparison you can make between two objects in Swift.
ja: あなたがスウィフトにおいて２つのオブジェクトの間に作ることができる比較には２つの別個の型があります。

source: There are, however, various pointer types available for your use when you need direct access to memory.
ja: しかし、あなたがメモリへの直接のアクセスを必要とするとき、あなたの利用に応じられるいろいろなポインター型があります。

source: There is no explicit delineation between the implementation and the interface—all of the information about a class, function, or constant resides in a single .swift file.
ja: 明確な境界線が実装とインタフェースの間にありません ― クラス、関数、または定数に関する全ての情報は１つの.swiftファイルに属します。

source: There is no way to recover from Objective-C exceptions directly in Swift.
ja: スウィフトには直接にObjective-C例外から回復する方法はありません。

source: There may be edge cases in your code that are not automatically handled.
ja: 自動的に処理されることが際どい場合があなたのコードであるかもしれません。

source: Therefore, the class you migrate cannot have any Objective-C subclasses in your app.
ja: したがって、あなたが移行するクラスは、あなたのアプリにおいて１つもObjective-Cサブクラスを持つことができません。

source: Therefore, the complex macros that are in C and Objective-C source files are not made available to your Swift code.
ja: したがって、CとObjective-Cソース・ファイルの中にある複雑なマクロは、あなたのスウィフトコードで利用可能にされません。

source: Therefore, use these types if your code specifically requires them, but use Int wherever possible otherwise.
ja: したがって、あなたのコードが特にそれらを必要とする場合にこれらの型を使ってください、しかし一方で可能な場合にはいつでもIntを使ってください。

source: Therefore, using these APIs is strongly discouraged unless your code specifically relies on the dynamic method resolution provided by the Objective-C runtime.
ja: それゆえに、これらのAPIを使うことは強く反対されます、あなたのコードがObjective-Cランタイムによって提供される動的メソッド解決を特別に当てにするのでない限りは。

source: Therefore, when you work with APIs that operate on the string representation of a Swift class, you must include the fully qualified name of the class.
ja: それゆえに、あなたがあるスウィフトクラスの文字列表現で作動するAPIを扱うとき、あなたはそのクラスの完全修飾名を含めなければなりません。

source: These UITableView and UITextField objects are the same objects that you’d instantiate in Objective-C.
ja: これらのUITableViewとUITextFieldオブジェクトは、それらがObjective-Cでインスタンス化するのと同じオブジェクトです。

source: These headers vend the APIs that can be mapped back to Objective-C.
ja: これらのヘッダは、Objective-Cに逆にマップされることができるAPIを売り歩きます。

source: These include NSLocalizedString, NSLocalizedStringFromTable, NSLocalizedStringFromTableInBundle, and NSLocalizedStringWithDefaultValue.
ja: これらは、NSLocalizedString, NSLocalizedStringFromTable, NSLocalizedStringFromTableInBundle, そしてNSLocalizedStringWithDefaultValueを含みます。

source: These representations can then be written to a file, or transmitted to another process locally or over a network.
ja: これらの表現は、それからファイルに書き出されたり、別のプロセスにローカルにまたはそのネットワークを超えて送られたりができます。

source: These should not be overridden.
ja: これらはオーバーライドされるべきではありません。

source: These types let you access the memory as a collection, where each item is an instance of the buffer type’s Element generic type parameter.
ja: これらの型は、あなたにコレクションとしてメモリにアクセスさせます、そこで各項目はそのバッファ型のもつElement総称体型パラメータのインスタンスです。

source: These types let you use low-level programming patterns, such as operating on raw memory without compiler-checked type safety, or switching between several different typed interpretations of the same memory.
ja: これらの型はあなたに低水準プログラミングパターンを使用させます、たとえばコンパイラ確認の型安全なしの生の値上での演算など、または同じメモリのいくつかの異なる型での実装の間での切り替えなど。

source: These value types have the same functionality as their corresponding reference types.
ja: これらの値型は、それらの対応する参照型と同じ機能性を持ちます。

source: This allows them to be used with the same syntax as initializers.
ja: これは、それらにイニシャライザと同じ構文で使用されることを可能にします。

source: This allows you to write maintain flexibility of untyped access to Objective-C APIs that return id values.
ja: これがあなたに書くことを可能にするのは、id値を返すObjective-C APIに対する型なしでのアクセスの柔軟性の維持です。

source: This approach simplifies the logic of handling different platform capabilities.
ja: この取り組みは、異なるプラットホーム適応性の取り扱い論理を単純にします。

source: This automatically generated file is an Objective-C header that declares the Swift interfaces in your target.
ja: この自動的に生成されるファイルは、あなたのターゲットの中のスウィフトインタフェースを宣言するObjective-Cヘッダです。

source: This documentation contains preliminary information about an API or technology in development.
ja: この文書は、開発でのテクノロジーまたはAPIのための事前の情報を含んでいます。

source: This example extends the CGRect structure to contain a computed area property:
ja: この例は、CGRect構造体を拡張して、計算areaプロパティを含むようにします：

source: This example shows how to generate errors using that custom error type in Swift:
ja: この例は、そのあつらえのエラー型をスウィフトにおいて使うことでエラーを生成する方法を示します：

source: This exception ensures that an older compiler doesn’t attempt to parse syntax introduced in a newer version of Swift.
ja: この例外は、古いコンパイラがより新しいバージョンのスウィフトで導入される構文の解析を試みないことを確実にします。

source: This excludes Swift-only features, such as those listed here:
ja: これは、ここに一覧にされるようなスウィフトのみの機能を除外します：

source: This guide covers three important aspects of Swift and Objective-C compatibility that you can use to your advantage when developing Cocoa apps:
ja: このガイドは、この互換性の３つの重要な面を扱います、それは、あなたがココア・アプリを開発するときあなたの強みとして使うことができるものです：

source: This includes all of the Objective-C system frameworks—such as Foundation, UIKit, and SpriteKit—as well as common C libraries supplied with the system.
ja: これは、Objective-Cシステムフレームワークの全て ― Foundation、UIKit、そしてSpriteKitなど ― それだけでなくシステムで供給される一般的なCライブラリをも含みます。

source: This information is subject to change, and software implemented according to this documentation should be tested with final operating system software.
ja: この情報は変更される場合があり、この文書に沿って実装されるソフトウェアは最終的なオペレーティングシステム・ソフトウェアでテストされなければなりません。

source: This is because all Swift code is syntax checked, even when it is not compiled.
ja: これは全てのスウィフトコードが、それがコンパイルされないときでも、構文チェックされるからです。

source: This is discussed in more detail in Swift and Objective-C in the Same Project.
ja: これは、より詳細に同じプロジェクト中のスウィフトとObjective-Cで議論されます。

source: This is done for compatibility with C, which allows any value to be stored in an enumeration, including values used internally but not exposed in headers.
ja: これは、Cとの互換性のために行われます、それはどんな値も列挙に格納されることを許します、内部的に使われるがヘッダに暴露されない値も含めて。

source: This is true even though the instance’s defining type is bridged to Swift as a structure type.
ja: これは、たとえそのインスタンスのもつ定義型がスウィフトへ構造体型としてブリッジされるとしても当てはまります。

source: This keyword can be used only for properties that are optional class types.
ja: オプショナルのクラス型であるプロパティだけに対して、このキーワードは使われることができます。

source: This lets you take advantage of the functionality available on the reference type’s implementation in a way that is natural in Swift code.
ja: これは、あなたに参照型の実装上で利用可能な機能性を、スウィフトコードにおける自然な方法で利用させます。

source: This limitation no longer exists.
ja: この制限はもはや存在しない。

source: This makes Swift an easy, convenient, and powerful tool to integrate into your development workflow.
ja: これは、スウィフトを簡単で、便利で、強力なツールにして、あなたの開発ワークフローへと統合させます。

source: This means that you can create classes and protocols based on familiar, established behavior in Objective-C and enhance them with Swift’s modern and powerful language features.
ja: これは、あなたがObjective-Cでのお馴染みの、確立された挙動に基づいてクラスおよびプロトコルを作成して、それらをスウィフトの現代的で強力な言語機能で強化することができることを意味します。

source: This means tidying up and modernizing your existing Objective-C codebase.
ja: これは、あなたの既存のObjective-Cコードベースを整えて、現代化することを意味します。

source: This natural workflow makes creating mixed-language app and framework targets as straightforward as creating an app or framework target written in a single language.
ja: この自然なワークフローは、一つの言語で書かれるアプリまたはフレームワーク・ターゲットをつくるのと同じくらい直接的に、混合言語のアプリとフレームワーク・ターゲットを作成することをもたらします。

source: This table describes the changes to Using Swift with Cocoa and Objective-C.
ja: この表は「CocoaとObjective-Cとともにスウィフトを使う」に対する変更点を記述します。

source: This way, you can let the storyboard connect the outlets at runtime, after initialization.
ja: そうして、あなたは、初期化の後で、実行時にストーリーボードをアウトレットたちに接続させます。

source: Throwing an Error
ja: エラーをスローする

source: To avoid this, you can instead have the block capture a weak reference to self:
ja: これを避けるために、あなたは代わりにブロックがselfに対する弱い参照をキャプチャするようにできます：

source: To be accessible and usable in Objective-C, a Swift class must be a descendant of an Objective-C class or it must be marked @objc.
ja: Objective-Cでアクセス可能にされて利用可能にされるために、スウィフトクラスはObjective-Cクラスの子孫でなければなりません、あるいは、それは@objcで印されなければなりません。

source: To be accessible and usable in Objective-C, a Swift class must be a descendant of an Objective-C class.
ja: Objective-Cでアクセス可能で利用可能であるために、スウィフトクラスはObjective-Cクラスの子孫でなければなりません。

source: To configure a Swift subclass of NSManagedObject for use by a Core Data model entity, open the model entity inspector in Xcode, enter the class name into the Class field, and choose “Current Product Module” from the Module field drop-down list.
ja: あるコアデータ・エントリによって使うためにNSManagedObjectのスウィフトサブクラスを構成するには、そのモデルのEntityインスペクタをXcodeにおいて開いて、クラス名をClass欄に入力して、「Current Product Module」をModule欄ポップダウンリストから選んでください。

source: To construct a selector for a property’s Objective-C getter or setter method, pass the property name prefixed by the getter: or setter: label, such as #selector(getter: MyViewController.myButton).
ja: あるプロパティの持つObjective-Cゲッターまたはセッターメソッドに対してセレクタを組み立てるには、getter:またはsetter:接頭辞を付けられたプロパティ名を渡してください、例えば#selector(getter: MyViewController.myButton)のように。

source: To create a Swift class that inherits from an Objective-C class, add a colon (:) after the name of the Swift class, followed by the name of the Objective-C class.
ja: Objective-Cクラスから継承するスウィフトクラスを作成するために、スウィフトクラスの名前の後にコロン（:）、それに続けてObjective-Cクラスの名前を加えてください。

source: To create a Swift project in Xcode
ja: Xcodeにおいてスウィフトプロジェクトを作成します

source: To create a Swift protocol that can be adopted by an Objective-C class, mark the protocol declaration with the @objc attribute.
ja: Objective-Cクラスによって採用されることができるスウィフトプロトコルを宣言するには、protocol宣言を@objc属性で印してください。
